In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'Name':['vicky','Bill'],'Age':[12,46]})
df2=pd.DataFrame({'Name':['John','run'],'Age':[34,42]})

In [3]:
df1

    Name  Age
0  vicky   12
1   Bill   46

In [4]:
df2

   Name  Age
0  John   34
1   run   42

In [5]:
# concat horizontally
pd.concat([df1,df2],axis=1)

    Name  Age  Name  Age
0  vicky   12  John   34
1   Bill   46   run   42

In [6]:
# concat virtically and ignore index
df3=pd.concat([df1,df2],axis=0)

In [7]:
df3

    Name  Age
0  vicky   12
1   Bill   46
0   John   34
1    run   42

In [13]:
df4=pd.DataFrame({'Name':['Tyler','Natalie'],'Age':[23,45],'Hobby':['Swimmig','Readdin']})
df4

      Name  Age    Hobby
0    Tyler   23  Swimmig
1  Natalie   45  Readdin

In [14]:
# outer 
pd.concat([df3,df4], join='outer',ignore_index=True)

      Name  Age    Hobby
0    vicky   12      NaN
1     Bill   46      NaN
2     John   34      NaN
3      run   42      NaN
4    Tyler   23  Swimmig
5  Natalie   45  Readdin

In [15]:
# inner
pd.concat([df3,df4], join='inner',ignore_index=True)

      Name  Age
0    vicky   12
1     Bill   46
2     John   34
3      run   42
4    Tyler   23
5  Natalie   45

In [17]:
size=pd.DataFrame({'colour':['Red','Blue','Green'],'Size':['M','S','M']})
gender=pd.DataFrame({'colour':['Red','Blue','Yellow'],'Sex':['Female','Female','Male']})
size

  colour Size
0    Red    M
1   Blue    S
2  Green    M

In [18]:
gender

   colour     Sex
0     Red  Female
1    Blue  Female
2  Yellow    Male

In [19]:
# merge inner
pd.merge(size,gender,how='inner')

  colour Size     Sex
0    Red    M  Female
1   Blue    S  Female

In [20]:
pd.merge(size,gender,how='outer')

   colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2   Green    M     NaN
3  Yellow  NaN    Male

In [21]:
#merge left 
pd.merge(size,gender,how="left")

  colour Size     Sex
0    Red    M  Female
1   Blue    S  Female
2  Green    M     NaN

In [22]:
pd.merge(size,gender,how="right")

   colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2  Yellow  NaN    Male